In [1]:
import numpy as np 
import pandas as pd

# Covid Data

In [3]:
df=pd.read_csv("C:\\Users\\DELL\\OneDrive\\Desktop\\Regex\\Adv Python\\covid_toy.csv")
df.head(2)

   age gender  fever cough     city has_covid
0   60   Male  103.0  Mild  Kolkata        No
1   27   Male  100.0  Mild    Delhi       Yes

In [6]:
x=df.drop(columns=['has_covid'],axis=1) # independent data
x.head(2)

   age gender  fever cough     city
0   60   Male  103.0  Mild  Kolkata
1   27   Male  100.0  Mild    Delhi

In [9]:
y=df['has_covid'] # dependent data
y.head(2)

0     No
1    Yes
Name: has_covid, dtype: object

In [10]:
print("Total Data Shape=",df.shape)
print("Independent Data Shape=",x.shape)
print("Dependent Data Shape=",y.shape)

Total Data Shape= (100, 6)
Independent Data Shape= (100, 5)
Dependent Data Shape= (100,)

In [11]:
from sklearn.model_selection import train_test_split

In [12]:
x_train , x_test , y_train , y_test =train_test_split(x,y,test_size =0.2 , random_state=42)

In [13]:
print("Total Data Shape=",df.shape)
print("Independent Data Shape=",x.shape)
print("Dependent Data Shape=",y.shape)
print("X_train Data Shape=",x_train.shape)
print("X_test Data Shape=",x_test.shape)

Total Data Shape= (100, 6)
Independent Data Shape= (100, 5)
Dependent Data Shape= (100,)
X_train Data Shape= (80, 5)
X_test Data Shape= (20, 5)

# Tips Data

In [15]:
df=pd.read_csv("C:\\Users\\DELL\\OneDrive\\Desktop\\Regex\\Adv Python\\tips.csv")
df.head(10)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2

In [16]:
x=df.drop(columns=['tip'],axis=1) # independent data
x.head(2)

   total_bill     sex smoker  day    time  size
0       16.99  Female     No  Sun  Dinner     2
1       10.34    Male     No  Sun  Dinner     3

In [17]:
y=df['tip']
y

0      1.01
1      1.66
2      3.50
3      3.31
4      3.61
       ...
239    5.92
240    2.00
241    2.00
242    1.75
243    3.00
Name: tip, Length: 244, dtype: float64

In [18]:
print("Total Data Shape=",df.shape)
print("Independent Data Shape=",x.shape)
print("Dependent Data Shape=",y.shape)

Total Data Shape= (244, 7)
Independent Data Shape= (244, 6)
Dependent Data Shape= (244,)

In [19]:
x_train , x_test , y_train , y_test = train_test_split(x , y , test_size=0.2 , random_state=42)

In [20]:
print("Total Data Shape=",df.shape)
print("Independent Data Shape=",x.shape)
print("Dependent Data Shape=",y.shape)
print("X_train Data Shape=",x_train.shape)
print("X_test Data Shape=",x_test.shape)

Total Data Shape= (244, 7)
Independent Data Shape= (244, 6)
Dependent Data Shape= (244,)
X_train Data Shape= (195, 6)
X_test Data Shape= (49, 6)

# Titanic data

In [26]:
df=pd.read_csv("C:\\Users\\DELL\\OneDrive\\Desktop\\Regex\\Adv Python\\titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [23]:
x=df.drop(columns=['Survived'],axis=1)
x.head(3)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q

In [24]:
y=df['Survived']

In [25]:
print("Total Data Shape=",df.shape)
print("Independent Data Shape=",x.shape)
print("Dependent Data Shape=",y.shape)

Total Data Shape= (418, 12)
Independent Data Shape= (418, 11)
Dependent Data Shape= (418,)

In [27]:
x_train , x_test , y_train , y_test = train_test_split(x , y , test_size=0.2 , random_state=42)

In [28]:
print("Total Data Shape=",df.shape)
print("Independent Data Shape=",x.shape)
print("Dependent Data Shape=",y.shape)
print("X_train Data Shape=",x_train.shape)
print("X_test Data Shape=",x_test.shape)

Total Data Shape= (418, 12)
Independent Data Shape= (418, 11)
Dependent Data Shape= (418,)
X_train Data Shape= (334, 11)
X_test Data Shape= (84, 11)